.metadata/.plugins/org.eclipse.core.resources/.history/e2/f073ca08ea6d00171dd0cd7543488c96

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="reciveSeq1" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log description="incoming responce logging" level="full"/>
    <filter description="" xmlns:ns="http://org.apache.synapse/xsd" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xpath="/soapenv:Envelope/soapenv:Body/ns:getQuoteResponse/ns:return/*[8]/text()">
        <then>
            <payloadFactory description="                      " media-type="xml">
                <format>
                    <soapenv:Envelope xmlns:echo="http://echo.services.core.carbon.wso2.org">
                        <soapenv:Header/>
                        <soapenv:Body>
                            <echo:echoString>
                                <!--Optional:-->
                                <in>$1</in>
                            </echo:echoString>
                        </soapenv:Body>
                    </soapenv:Envelope>
                </format>
                <args/>
            </payloadFactory>
            <log description="tetsPyloadFactoryLogger">
                <property name="payloadoutput" value="pay load output"/>
            </log>
            <send description="DispatchToEchServer" receive="echoRespoceSeq">
                <endpoint>
                    <http method="get" uri-template="http://10.100.1.11:9764/services/echo/ "/>
                </endpoint>
            </send>
        </then>
        <else>
            <log description="messageDropLog" separator="#####################"/>
        </else>
    </filter>
</sequence>
