.metadata/.plugins/org.eclipse.core.resources/.history/4b/d0b3be1efc6d0017149fd426916b0522

<?xml version="1.0" encoding="UTF-8"?>
<sequence name="reciveSeq1" trace="disable" xmlns="http://ws.apache.org/ns/synapse">
    <log description="incoming responce logging" level="full">
        <property name="message" value="incoming Request to PayLoad###"/>
    </log>
    <payloadFactory description="addSoapBody" media-type="xml">
        <format>
            <soapenv:Envelope xmlns:echo="http://echo.services.core.carbon.wso2.org" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
                <soapenv:Header/>
                <soapenv:Body>
                    <echo:echoString>
                        <!--Optional:-->
                        <in>ibm</in>
                    </echo:echoString>
                </soapenv:Body>
            </soapenv:Envelope>
        </format>
        <args/>
    </payloadFactory>
    <log/>
</sequence>
